# ClosestPointsPairBetweenTwoCurves Class

---
This class captures results of computation of closest points between two generic curves.
SystemObject Autodesk.Revit.DBClosestPointsPairBetweenTwoCurves
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ClosestPointsPairBetweenTwoCurves : IDisposable

    Public Class ClosestPointsPairBetweenTwoCurves
    	Implements IDisposable

    public ref class ClosestPointsPairBetweenTwoCurves : IDisposable

    type ClosestPointsPairBetweenTwoCurves =
        class
            interface IDisposable
        end
The ClosestPointsPairBetweenTwoCurves type exposes the following members.
| Name| Description
---|---|---
| ClosestPointsPairBetweenTwoCurves|  Obtain a new instance of ClosestPointsPairBetweenTwoCurves class.
| ClosestPointsPairBetweenTwoCurves(ClosestPointsPairBetweenTwoCurves)|  Creates a copy of the ClosestPointsPairBetweenTwoCurves.
Top
| Name| Description
---|---|---
| Distance|  Distance from point on first curve to the point on second curve.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| ParameterOnFirstCurve|  1d raw (not normalized) parameter of the point on the first curve.
| ParameterOnSecondCurve|  1d raw (not normalized) parameter of the point on the second curve.
| XYZPointOnFirstCurve|  Point on the first curve in 3d coordinates.
| XYZPointOnSecondCurve|  Point on the second curve in 3d coordinates.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ClosestPointsPairBetweenTwoCurves
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace